// 1. Внутренние процессы компьютера
// 1. Переменные
// 3. Типы данных
// 4. Компиляция и Интерпретация
// 5. Подпрограммы(функции)
// 6. JavaScript(EcmaScript - 262)
// 7. Регистрозависимый язык
// 8. Типы данных  - число
// 9. Операторы и Операнды
// 10. Арифметические операторы
// 11. Унарные/бинарные операторы
// 12. Операторы группировки
// 13. Типы данных - строка
// 14. Спецсимволы
// 15. Конкатенирование
// 16. Операторы сравнения
// 17. Тип данных - Boolean
// 18. Логические операторы
// 19. Приведение типов
// 20. Объявление переменных
// 21. Операторы присваивания
// 22. NaN
// 23. Undefined
// 24. null
// 25. Циклы(управляющие конструкции)
// 26. Операторы инкремента/декремента
// 27. Цикл for
// 28. Управляющая конструкция if/else if/ else
// 29. Тернарный оператор
// 30. Continue/ break
// 31. Switch
//  32. Function
//  33. Глобальная/локальная области видимости
// 34. Замыкание
// 35. Передача параметров функции
// 36. Рекурсия
37.